{
    "Jump to:": [
        "Best Pickup Lines",
        "Funny Pickup Lines",
        "Cheesy Pickup Lines",
        "Cute Pickup Lines",
        "Pickup Lines for Girls",
        "Pickup Lines for Guys"
    ],
    "Best Pickup Lines": [
        "Do you have a name, or can I just call you 'mine'?",
        "I seem to have lost my phone number. Can I have yours?",
        "You're so fine, you made me forget my pickup line.",
        "Did we go to school together? I could swear we had chemistry.",
        "Want a raisin? No? How about a date?",
        "What's your favorite drink? I'm asking so I know what to buy you on our first date.",
        "Have we met? Because you look exactly like my next boyfriend/girlfriend/partner.",
        "I never believed in love at first sight, but that's before I saw you.",
        "Do you have a map? Because I just got lost in your eyes.",
        "You owe me a drink. Because when I saw you, I dropped mine.",
        "They say nothing lasts forever, so will you be my nothing?",
        "Want to go outside for some fresh air? You took my breath away.",
        "If you were a song, you'd be the best single on the album.",
        "You remind me of a magnet because you sure are attracting me over here.",
        "I’m going to have to ask you to leave, you’re making everyone else in here look bad.",
        "My parents told me not to talk to strangers, but I’ll make an exception for you."
    ],
    "Funny Pickup Lines": [
        "Do you believe in love at first sight, or should I walk by again?",
        "I hope you know CPR, because you are taking my breath away.",
        "It's a good thing I have my library card, because I am totally checking you out.",
        "Are you a time traveler? Because I see you in my future.",
        "Your hand looks lonely. Can I hold it for you?",
        "I believe in following my dreams. Can I have your Instagram?",
        "Is your name Google? Because you're everything I've been searching for.",
        "Did the sun come out, or did you just smile at me?",
        "To quote the poet Katy Perry, \"You make me feel like I'm living a teenage dream.\"",
        "Hey, my name's Microsoft. Can I crash at your place tonight?",
        "Did your license get suspended for driving all those guys crazy?",
        "Are you a broom? Because you've swept me off my feet.",
        "Do you have a Band-Aid? I scraped my knee falling for you.",
        "I'm learning about important dates in history, wanna be one of them?",
        "Let’s taco ‘bout how amazing you are over tacos and margaritas next week.",
        "What do you call a string of people lifting a mozzarella cheese? A cheesy pickup line.",
        "Do you play soccer? Because you look like a keeper.",
        "How can I plan our wedding if I don’t have your number?",
        "You can delete the dating app now, I’m here."
    ],
    "Cheesy Pickup Lines": [
        "This might sound cheesy, but I think you’re really grate.",
        "If you were a fruit, you'd be a \"fine-apple.\"",
        "Are you from Tennessee? Because you're the only 10 I see.",
        "Wanna touch my shirt? It's made of boyfriend/girlfriend/partner material.",
        "Are your parents bakers? Because you're a cutie pie.",
        "If you and I were socks, we'd make a great pair.",
        "Did it hurt when you fell from heaven?",
        "Aren't you tired? From running through my mind all day?",
        "If I could rearrange the alphabet, I'd put U and I together.",
        "Well, here I am! What are your other two wishes?",
        "Are you a parking ticket? You've got fine written all over you.",
        "If you were a chicken, you'd be \"im-peck-able\"",
        "Did you just come out of an oven? Because you're too hot to handle.Woman's Day",
        "They say dating is a numbers game, so can I get yours?",
        "Know what's on the menu today? Me 'n u.",
        "I was feeling a little off today, but you've turned me on again.",
        "Is your dad a boxer? Because you're a knockout.",
        "Are you a loan? Because you've got my interest.",
        "If you were a vegetable, you'd be a cute-cumber.",
        "Are you French? Because Eiffel for you.",
        "Are you my appendix? Because this feeling in my stomach makes me want to take you out.",
        "If you were a triangle, you'd be acute one.",
        "I'm new in town, can I have directions to your house?",
        "Are you a magician? Because when I look at you, everyone else disappears.",
        "Wow, I've been blinded by your beauty. I'll need your name and number for insurance purposes.",
        "Are you a keyboard? Because I think you might just be my type.",
        "Stop, drop and roll! Because baby, you’re on fire.",
        "Oh, you’ve got something on your face. [They wipe/say “what is it?”] My eyes.",
        "If you were a potato, you’d be a sweet potato."
    ],
    "Cute Pickup Lines": [
        "If I were a cat, I'd spend all nine of my lives with you.",
        "I thought this was a [restaurant/bar/etc.] but it must actually be a museum, because you're a work of art.",
        "What is it like to be the most gorgeous person in this room?",
        "I don't know your name, but I'm sure it's just as beautiful as you are.",
        "I'm not a photographer, but I can definitely picture us together.",
        "Did you do something to my eyes? I can't seem to take them off you.",
        "Are you an electrician? Because you're lighting up my day.",
        "(At a bar) I'm not drunk, I'm just intoxicated by you.",
        "Do you have a sunburn, or are you just always this hot?",
        "I'm not an organ donor, but I'm ready to give you my heart.",
        "Anyone who says Disneyland is the happiest place on earth has clearly never stood next to you.",
        "I'd say God bless you, but it looks like he already has.",
        "Are you a charger? Because I'm dying without you.Woman's Day",
        "If you let me borrow a kiss, I promise I'll give it right back.",
        "I've been told I'm good with numbers, how about you give me yours so I can prove it?",
        "You're so sweet you're giving me a toothache.",
        "I'm sorry, were you talking to me? (They say no). Well, would you like to?",
        "I can see that you're gorgeous, but what else should I know about you?",
        "Are you as beautiful on the inside as you are on the outside?",
        "Well I was just trying to [have dinner/have a drink] but you're very distracting.",
        "You've got everything I've been looking for, and trust me, I've been looking for a long time.",
        "Can I have your picture so I can show Santa what I want for Christmas this year?",
        "On a scale of 1 to 10, you're a 9 and I'm the 1 you need.",
        "I'd never play hide and seek with you, because someone like you is impossible to find.",
        "Do you know what the Little Mermaid and I have in common? We both want to be part of your world.",
        "If people were flowers, I’d pick you.",
        "Guess what I’m wearing? The smile you gave me.",
        "Are you a camera? Because all I can do is smile when I see you."
    ],
    "Pickup Lines for Girls": [
        "I think someone must have stolen the stars and put them in your eyes.",
        "I saw you walking by and I just had to come say hello.",
        "You know what you'd look beautiful in? My arms.",
        "The sparkle in your eye is so bright, the sun and stars must be jealous.",
        "You look like you know how to have a good time! Been on any fun adventures lately?",
        "(At a bar or other public place) You see my friend over there? He/she/they want to know if you think I'm cute.",
        "I think I saw you on Spotify, as the hottest single of the year.",
        "When God made you, he was really just showing off.",
        "Do you have the time? I want to remember the exact minute I fell for you.",
        "If you were words on a page, you'd be fine print.",
        "Not to be dramatic, but I think you're the answer to my prayers.",
        "I think there's something wrong with my phone. Your number's not in it.",
        "You're so beautiful you made me forget my pickup line.",
        "When I text you good morning tomorrow, what number should I text?",
        "What emoji should I put next to your name in my phone?",
        "Can I borrow your phone? I need to call God and tell him I’ve found his missing angel.",
        "Let’s count shoulders! [Count your own as 1, 2, starting from left to right, then count theirs and slide your arm around their shoulders as you count 3 and 4]"
    ],
    "Pickup Lines for Guys": [
        "Did you invent the airplane? Because you're clearly Mr. Wright.",
        "Those are nice arms. Could I see how they would feel around me?",
        "I was wondering if you're an artist, because you're so good at drawing me in.",
        "I've always thought happiness started with an \"H\" but it looks like it starts with \"U.\"",
        "Hi, my name is [your name], but you can call me tonight or tomorrow.",
        "Now that I've seen you, life without you is like a broken pencil ... pointless.",
        "I'm not sure what it is about you, but I feel like I have to get to know you.",
        "Do you like Star Wars? Because Yoda only one for me.",
        "My friends bet me I couldn't chat up the hottest guy in the bar. Want to use their money to buy some more drinks?",
        "I believe in honesty, so let me be honest: you're the most attractive man I've ever seen.",
        "You must be a talented thief, because you managed to steal my heart from all the way over here.",
        "I had a good pickup line ready to go, but you're so good-looking I'm literally speechless.",
        "I'm surprised they haven't asked you to leave yet. You're making all the other men in here look bad.",
        "Can we take a picture together? I want to show my mom what my next boyfriend looks like.",
        "I didn't know what I wanted in a man until I saw you.",
        "I have a question and need a man/woman’s advice. [They say, “okay, what’s up?] If I see a really cute guy/girl, should I just go talk to him/her or is that too direct? [They say, “you should talk to them!\"] Hi, I’m (your name)."
    ],
    "Dating + Marriage": []
}